tests/test-api-load.yaml
---
scenarios:
  api_test:
    requests:
      - url: http://localhost:8080/get
        label: Get Post 1

      - url: http://localhost:8080/post
        method: POST
        label: Create Post
        body:
          title: Test Post
          body: This is a test post
          userId: 1

execution:
  - concurrency: 10
    hold-for: 1m
    scenario: api_test

reporting:
  - module: console
  - module: final-stats
  - module: junit-xml